tests/data/output.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns0="http://xmlns.rfxcel.com/traceability/api/3" xmlns:ns1="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns2="http://xmlns.rfxcel.com/traceability/messagingService/3" xmlns:ns3="http://xmlns.rfxcel.com/traceability/3" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<SOAP-ENV:Header xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xsi:schemaLocation="http://schemas.xmlsoap.org/ws/2004/08/addressing ../SOAP-Security/addressing.xsd">
		<wsse:Security mustUnderstand="true">
			<wsse:UsernameToken wsu:Id="UsernameToken-1">
				<wsse:Username></wsse:Username>
				<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText"></wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
	</SOAP-ENV:Header>
	<ns1:Body>
		<ns2:processMessages contentStructVer="3.1.3" createDateTime="2016-02-20T22:56:02Z" requestId="Commission-01-02-15">
			<ns2:msgEnvelopeList>
				<ns0:envelope>
					<ns0:header>
						<!-- Predefined Values in the System -->
						<ns0:msgInfo>
							<ns0:sysDeploymentId qlfr="SYS_DEF" xsi:type="ns3:QualifiedIdType"></ns0:sysDeploymentId>
							<ns0:senderInstId qlfr="SYS_DEF" xsi:type="ns3:QualifiedIdType"></ns0:senderInstId>
							<ns0:senderId qlfr="ORG_DEF" type="ORG_ID" xsi:type="ns3:TypedQualifiedIdType"></ns0:senderId>
							<ns0:receiverInstId qlfr="SYS_DEF" xsi:type="ns3:QualifiedIdType">rfXcel</ns0:receiverInstId>
							<ns0:receiverId qlfr="ORG_DEF" type="ORG_ID" xsi:type="ns3:TypedQualifiedIdType">1</ns0:receiverId>
							<ns0:msgFormat xsi:type="ns3:OptionallyVersionedEnumType">XML</ns0:msgFormat>
							<ns0:msgType ver="1.1" xsi:type="ns3:OptionallyVersionedEnumType">SYS_EVENTS_ENV</ns0:msgType>
						</ns0:msgInfo>
					</ns0:header>
					<ns0:body>
						<XML_SYS_EVENTS_ENV>
							<epcis:EPCISDocument
        xmlns:epcis="urn:epcglobal:epcis:xsd:1"
        xmlns:cbvmd="urn:epcglobal:cbv:mda"
        schemaVersion="1.2" creationDate="2018-11-05T20:01:46.964180">
    <EPCISBody>
        <EventList>
<ObjectEvent>
<eventTime>2017-12-30T22:51:49.294565+00:00</eventTime>
    <recordTime>2018-11-06T02:01:46.723343+00:00</recordTime>
    <eventTimeZoneOffset>+00:00</eventTimeZoneOffset>
        <epcList>
                <epc>urn:epc:id:sgtin:305555.0555555.8</epc>
                <epc>urn:epc:id:sgtin:305555.0555555.3</epc>
                <epc>urn:epc:id:sgtin:305555.0555555.2</epc>
                <epc>urn:epc:id:sgtin:305555.5555555.1</epc>
                <epc>urn:epc:id:sgtin:305555.0555555.10</epc>
                <epc>urn:epc:id:sgtin:305555.0555555.1</epc>
                <epc>urn:epc:id:sgtin:305555.3555555.1</epc>
                <epc>urn:epc:id:sgtin:305555.3555555.2</epc>
                <epc>urn:epc:id:sgtin:305555.0555555.5</epc>
                <epc>urn:epc:id:sgtin:305555.0555555.6</epc>
                <epc>urn:epc:id:sgtin:305555.0555555.7</epc>
                <epc>urn:epc:id:sgtin:305555.0555555.9</epc>
                <epc>urn:epc:id:sgtin:305555.0555555.4</epc>
        </epcList>
    <action>ADD</action>
    <bizStep>urn:epcglobal:cbv:bizstep:commissioning</bizStep>
    <disposition>urn:epcglobal:cbv:disp:encoded</disposition>
    <readPoint>
    <id>urn:epc:id:sgln:305555.123456.12</id>
    </readPoint>
    <bizLocation>
    <id>urn:epc:id:sgln:305555.123456.0</id>
    </bizLocation>
<bizTransactionList>
        <bizTransaction type="urn:epcglobal:cbv:btt:po">
            urn:epc:id:gdti:0614141.06012.1234
        </bizTransaction>
</bizTransactionList><extension>
<sourceList>
        <source type="urn:epcglobal:cbv:sdt:possessing_party">urn:epc:id:sgln:305555.123456.0</source>
        <source type="urn:epcglobal:cbv:sdt:location">urn:epc:id:sgln:305555.123456.12</source>
</sourceList><destinationList>
        <destination
                type="urn:epcglobal:cbv:sdt:owning_party">urn:epc:id:sgln:309999.111111.0</destination>
        <destination
                type="urn:epcglobal:cbv:sdt:location">urn:epc:id:sgln:309999.111111.233</destination>
</destinationList><ilmd>
            <itemExpirationDate>2015-12-31</itemExpirationDate>
            <lotNumber>DL232</lotNumber>
</ilmd></extension>
</ObjectEvent><AggregationEvent>
<eventTime>2018-01-22T22:51:49.294565+00:00</eventTime>
    <recordTime>2018-11-06T02:01:46.797083+00:00</recordTime>
    <eventTimeZoneOffset>+00:00</eventTimeZoneOffset>
        <parentID>urn:epc:id:sgtin:305555.5555555.1</parentID>
        <childEPCs>
                <epc>urn:epc:id:sgtin:305555.3555555.1</epc>
                <epc>urn:epc:id:sgtin:305555.3555555.2</epc>
        </childEPCs>
    <action>ADD</action>
    <bizStep>urn:epcglobal:cbv:bizstep:packing</bizStep>
    <disposition>urn:epcglobal:cbv:disp:container_closed</disposition>
    <readPoint>
    <id>urn:epc:id:sgln:305555.123456.12</id>
    </readPoint>
    <bizLocation>
    <id>urn:epc:id:sgln:305555.123456.0</id>
    </bizLocation>
<bizTransactionList>
        <bizTransaction type="urn:epcglobal:cbv:btt:po">
            urn:epc:id:gdti:0614141.06012.1234
        </bizTransaction>
</bizTransactionList><extension>
    <childQuantityList>
<quantityElement>
    <epcClass>urn:epc:idpat:sgtin:305555.0555555.*</epcClass>
    <quantity>5.0</quantity>
</quantityElement>
<quantityElement>
    <epcClass>urn:epc:idpat:sgtin:305555.0555555.*</epcClass>
    <quantity>14.5</quantity>
<uom>LB</uom></quantityElement>
    </childQuantityList>
<sourceList>
        <source type="urn:epcglobal:cbv:sdt:possessing_party">urn:epc:id:sgln:305555.123456.0</source>
        <source type="urn:epcglobal:cbv:sdt:location">urn:epc:id:sgln:305555.123456.12</source>
</sourceList><destinationList>
        <destination
                type="urn:epcglobal:cbv:sdt:owning_party">urn:epc:id:sgln:309999.111111.0</destination>
        <destination
                type="urn:epcglobal:cbv:sdt:location">urn:epc:id:sgln:309999.111111.233</destination>
</destinationList></extension>
</AggregationEvent>
<AggregationEvent>
<eventTime>2018-01-22T22:51:49.294565+00:00</eventTime>
    <recordTime>2018-11-06T02:01:46.776032+00:00</recordTime>
    <eventTimeZoneOffset>+00:00</eventTimeZoneOffset>
        <parentID>urn:epc:id:sgtin:305555.3555555.1</parentID>
        <childEPCs>
                <epc>urn:epc:id:sgtin:305555.0555555.3</epc>
                <epc>urn:epc:id:sgtin:305555.0555555.2</epc>
                <epc>urn:epc:id:sgtin:305555.0555555.1</epc>
                <epc>urn:epc:id:sgtin:305555.0555555.5</epc>
                <epc>urn:epc:id:sgtin:305555.0555555.4</epc>
        </childEPCs>
    <action>ADD</action>
    <bizStep>urn:epcglobal:cbv:bizstep:packing</bizStep>
    <disposition>urn:epcglobal:cbv:disp:container_closed</disposition>
    <readPoint>
    <id>urn:epc:id:sgln:305555.123456.12</id>
    </readPoint>
    <bizLocation>
    <id>urn:epc:id:sgln:305555.123456.0</id>
    </bizLocation>
<bizTransactionList>
        <bizTransaction type="urn:epcglobal:cbv:btt:po">
            urn:epc:id:gdti:0614141.06012.1234
        </bizTransaction>
</bizTransactionList><extension>
    <childQuantityList>
<quantityElement>
    <epcClass>urn:epc:idpat:sgtin:305555.0555555.*</epcClass>
    <quantity>5.0</quantity>
</quantityElement>
<quantityElement>
    <epcClass>urn:epc:idpat:sgtin:305555.0555555.*</epcClass>
    <quantity>14.5</quantity>
<uom>LB</uom></quantityElement>
    </childQuantityList>
<sourceList>
        <source type="urn:epcglobal:cbv:sdt:possessing_party">urn:epc:id:sgln:305555.123456.0</source>
        <source type="urn:epcglobal:cbv:sdt:location">urn:epc:id:sgln:305555.123456.12</source>
</sourceList><destinationList>
        <destination
                type="urn:epcglobal:cbv:sdt:owning_party">urn:epc:id:sgln:309999.111111.0</destination>
        <destination
                type="urn:epcglobal:cbv:sdt:location">urn:epc:id:sgln:309999.111111.233</destination>
</destinationList></extension>
</AggregationEvent>
<AggregationEvent>
<eventTime>2018-01-22T22:51:49.294565+00:00</eventTime>
    <recordTime>2018-11-06T02:01:46.787412+00:00</recordTime>
    <eventTimeZoneOffset>+00:00</eventTimeZoneOffset>
        <parentID>urn:epc:id:sgtin:305555.3555555.2</parentID>
        <childEPCs>
                <epc>urn:epc:id:sgtin:305555.0555555.8</epc>
                <epc>urn:epc:id:sgtin:305555.0555555.10</epc>
                <epc>urn:epc:id:sgtin:305555.0555555.6</epc>
                <epc>urn:epc:id:sgtin:305555.0555555.7</epc>
                <epc>urn:epc:id:sgtin:305555.0555555.9</epc>
        </childEPCs>
    <action>ADD</action>
    <bizStep>urn:epcglobal:cbv:bizstep:packing</bizStep>
    <disposition>urn:epcglobal:cbv:disp:container_closed</disposition>
    <readPoint>
    <id>urn:epc:id:sgln:305555.123456.12</id>
    </readPoint>
    <bizLocation>
    <id>urn:epc:id:sgln:305555.123456.0</id>
    </bizLocation>
<bizTransactionList>
        <bizTransaction type="urn:epcglobal:cbv:btt:po">
            urn:epc:id:gdti:0614141.06012.1234
        </bizTransaction>
</bizTransactionList><extension>
    <childQuantityList>
<quantityElement>
    <epcClass>urn:epc:idpat:sgtin:305555.0555555.*</epcClass>
    <quantity>5.0</quantity>
</quantityElement>
<quantityElement>
    <epcClass>urn:epc:idpat:sgtin:305555.0555555.*</epcClass>
    <quantity>14.5</quantity>
<uom>LB</uom></quantityElement>
    </childQuantityList>
<sourceList>
        <source type="urn:epcglobal:cbv:sdt:possessing_party">urn:epc:id:sgln:305555.123456.0</source>
        <source type="urn:epcglobal:cbv:sdt:location">urn:epc:id:sgln:305555.123456.12</source>
</sourceList><destinationList>
        <destination
                type="urn:epcglobal:cbv:sdt:owning_party">urn:epc:id:sgln:309999.111111.0</destination>
        <destination
                type="urn:epcglobal:cbv:sdt:location">urn:epc:id:sgln:309999.111111.233</destination>
</destinationList></extension>
</AggregationEvent>
<TransactionEvent>
<eventTime>2018-03-22T22:51:49.294565+00:00</eventTime>
    <recordTime>2018-11-05T20:01:46.847116</recordTime>
    <eventTimeZoneOffset>+00:00</eventTimeZoneOffset>
<bizTransactionList>
        <bizTransaction type="urn:epcglobal:cbv:btt:po">
            urn:epc:id:gdti:0614141.06012.1234
        </bizTransaction>
</bizTransactionList>        <action>ADD</action>
        <bizStep>urn:epcglobal:cbv:bizstep:shipping</bizStep>
        <disposition>urn:epcglobal:cbv:disp:in_transit</disposition>
        <readPoint>
        <id>urn:epc:id:sgln:305555.123456.12</id>
        </readPoint>
        <bizLocation>
        <id>urn:epc:id:sgln:305555.123456.0</id>
        </bizLocation>
<extension>
    <quantityList>
<quantityElement>
    <epcClass>urn:epc:idpat:sgtin:305555.0555555.*</epcClass>
    <quantity>5.0</quantity>
</quantityElement>
<quantityElement>
    <epcClass>urn:epc:idpat:sgtin:305555.0555555.*</epcClass>
    <quantity>14.5</quantity>
<uom>LB</uom></quantityElement>
    </quantityList>
<sourceList>
        <source type="urn:epcglobal:cbv:sdt:possessing_party">urn:epc:id:sgln:305555.123456.0</source>
        <source type="urn:epcglobal:cbv:sdt:location">urn:epc:id:sgln:305555.123456.12</source>
</sourceList><destinationList>
        <destination
                type="urn:epcglobal:cbv:sdt:owning_party">urn:epc:id:sgln:309999.111111.0</destination>
        <destination
                type="urn:epcglobal:cbv:sdt:location">urn:epc:id:sgln:309999.111111.233</destination>
</destinationList></extension>
</TransactionEvent>                <extension>
                </extension>
        </EventList>
    </EPCISBody>
</epcis:EPCISDocument>
						</XML_SYS_EVENTS_ENV>
					</ns0:body>
				</ns0:envelope>
			</ns2:msgEnvelopeList>
		</ns2:processMessages>
	</ns1:Body>
</SOAP-ENV:Envelope>