tests/data/rfxcel-lot-batch.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns0="http://xmlns.rfxcel.com/traceability/api/3" xmlns:ns1="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns2="http://xmlns.rfxcel.com/traceability/messagingService/3" xmlns:ns3="http://xmlns.rfxcel.com/traceability/3" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<SOAP-ENV:Header xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xsi:schemaLocation="http://schemas.xmlsoap.org/ws/2004/08/addressing ../SOAP-Security/addressing.xsd">
		<wsse:Security mustUnderstand="true">
			<wsse:UsernameToken wsu:Id="UsernameToken-1">
				<wsse:Username>wraser_dev_vantage</wsse:Username>
				<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Wfvbbte65_</wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
	</SOAP-ENV:Header>
	<ns1:Body>
		<ns2:processMessages contentStructVer="3.1.3" createDateTime="2016-02-20T22:56:02Z" requestId="Commission-01-02-15">
			<ns2:msgEnvelopeList>
				<ns0:envelope>
					<ns0:header>
						<!-- Predefined Values in the System -->
						<ns0:msgInfo>
							<ns0:sysDeploymentId qlfr="SYS_DEF" xsi:type="ns3:QualifiedIdType">Wraser</ns0:sysDeploymentId>
							<ns0:senderInstId qlfr="SYS_DEF" xsi:type="ns3:QualifiedIdType"> Wraser </ns0:senderInstId>
							<ns0:senderId qlfr="ORG_DEF" type="ORG_ID" xsi:type="ns3:TypedQualifiedIdType">0366992000009</ns0:senderId>
							<ns0:receiverInstId qlfr="SYS_DEF" xsi:type="ns3:QualifiedIdType">rfXcel</ns0:receiverInstId>
							<ns0:receiverId qlfr="ORG_DEF" type="ORG_ID" xsi:type="ns3:TypedQualifiedIdType">1</ns0:receiverId>
							<ns0:msgFormat xsi:type="ns3:OptionallyVersionedEnumType">XML</ns0:msgFormat>
							<ns0:msgType ver="1.1" xsi:type="ns3:OptionallyVersionedEnumType">SYS_EVENTS_ENV</ns0:msgType>
						</ns0:msgInfo>
					</ns0:header>
					<ns0:body>
						<XML_SYS_EVENTS_ENV>
							<epcis:EPCISDocument xmlns:cbvmd="urn:epcglobal:cbv:mda" xmlns:epcis="urn:epcglobal:epcis:xsd:1" creationDate="2018-10-12T17:07:59.092062" schemaVersion="1.2">
								<EPCISBody>
									<EventList>
										<ObjectEvent>
											<eventTime>2018-10-12T18:36:20.766663+00:00</eventTime>
											<recordTime>2018-10-12T18:36:20.766663+00:00</recordTime>
											<eventTimeZoneOffset>+00:00</eventTimeZoneOffset>
											<epcList>
												<epc>urn:epc:id:sscc:0342195.5000000480</epc>
											</epcList>
											<action>ADD</action>
											<bizStep>urn:epcglobal:cbv:bizstep:commissioning</bizStep>
											<disposition>urn:epcglobal:cbv:disp:active</disposition>
											<bizLocation>
												<id>urn:epc:id:sgln:0358716.00000.0</id>
											</bizLocation>
											<extension>
												<ilmd>
													<cbvmd:itemExpirationDate>2018-12-31</cbvmd:itemExpirationDate>
													<cbvmd:lotNumber>DL232</cbvmd:lotNumber>
												</ilmd>
											</extension>
										</ObjectEvent>
										<ObjectEvent>
											<eventTime>2018-10-12T18:36:20.773666+00:00</eventTime>
											<recordTime>2018-10-12T18:36:20.773666+00:00</recordTime>
											<eventTimeZoneOffset>+00:00</eventTimeZoneOffset>
											<epcList>
												<epc>urn:epc:id:sgtin:0342195.130809.759269197065</epc>
											</epcList>
											<action>ADD</action>
											<bizStep>urn:epcglobal:cbv:bizstep:commissioning</bizStep>
											<disposition>urn:epcglobal:cbv:disp:active</disposition>
											<bizLocation>
												<id>urn:epc:id:sgln:0358716.00000.0</id>
											</bizLocation>
											<extension>
												<ilmd>
													<cbvmd:itemExpirationDate>2018-12-31</cbvmd:itemExpirationDate>
													<cbvmd:lotNumber>DL232</cbvmd:lotNumber>
												</ilmd>
											</extension>
										</ObjectEvent>
										<ObjectEvent>
											<eventTime>2018-10-12T18:36:20.779861+00:00</eventTime>
											<recordTime>2018-10-12T18:36:20.779861+00:00</recordTime>
											<eventTimeZoneOffset>+00:00</eventTimeZoneOffset>
											<epcList>
												<epc>urn:epc:id:sgtin:0342195.030809.879681745852</epc>
											</epcList>
											<action>ADD</action>
											<bizStep>urn:epcglobal:cbv:bizstep:commissioning</bizStep>
											<disposition>urn:epcglobal:cbv:disp:active</disposition>
											<bizLocation>
												<id>urn:epc:id:sgln:0358716.00000.0</id>
											</bizLocation>
											<extension>
												<ilmd>
													<cbvmd:itemExpirationDate>2018-12-31</cbvmd:itemExpirationDate>
													<cbvmd:lotNumber>DL232</cbvmd:lotNumber>
												</ilmd>
											</extension>
										</ObjectEvent>
										<AggregationEvent>
											<eventTime>2018-10-12T18:36:20.770447+00:00</eventTime>
											<recordTime>2018-10-12T18:36:20.770447+00:00</recordTime>
											<eventTimeZoneOffset>+00:00</eventTimeZoneOffset>
											<parentID>urn:epc:id:sscc:0342195.5000000480</parentID>
											<childEPCs>
												<epc>urn:epc:id:sgtin:0342195.130809.759269197065</epc>
											</childEPCs>
											<action>ADD</action>
											<bizStep>urn:epcglobal:cbv:bizstep:packing</bizStep>
											<disposition>urn:epcglobal:cbv:disp:in_progress</disposition>
											<bizLocation>
												<id>urn:epc:id:sgln:0358716.00000.0</id>
											</bizLocation>
										</AggregationEvent>
										<AggregationEvent>
											<eventTime>2018-10-12T18:36:20.776367+00:00</eventTime>
											<recordTime>2018-10-12T18:36:20.776367+00:00</recordTime>
											<eventTimeZoneOffset>+00:00</eventTimeZoneOffset>
											<parentID>urn:epc:id:sgtin:0342195.130809.759269197065</parentID>
											<childEPCs>
												<epc>urn:epc:id:sgtin:0342195.030809.879681745852</epc>
											</childEPCs>
											<action>ADD</action>
											<bizStep>urn:epcglobal:cbv:bizstep:packing</bizStep>
											<disposition>urn:epcglobal:cbv:disp:in_progress</disposition>
											<bizLocation>
												<id>urn:epc:id:sgln:0358716.00000.0</id>
											</bizLocation>
										</AggregationEvent>
									</EventList>
								</EPCISBody>
							</epcis:EPCISDocument>
						</XML_SYS_EVENTS_ENV>
					</ns0:body>
				</ns0:envelope>
			</ns2:msgEnvelopeList>
		</ns2:processMessages>
	</ns1:Body>
</SOAP-ENV:Envelope>
