docs/examples/rfxcel_template.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:ns3="http://xmlns.rfxcel.com/traceability/3" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:ns0="http://xmlns.rfxcel.com/traceability/api/3" xmlns:ns1="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns2="http://xmlns.rfxcel.com/traceability/messagingService/3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xsi:schemaLocation="http://schemas.xmlsoap.org/ws/2004/08/addressing ../SOAP-Security/addressing.xsd">
		<wsse:Security mustUnderstand="true">
			<wsse:UsernameToken wsu:Id="UsernameToken-1">
        <!--
        Enter in the user name and password below.
        -->
				<wsse:Username>[USERNAME]</wsse:Username>
				<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">[PASSWORD]</wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
	</SOAP-ENV:Header>
	<ns1:Body>
		<ns2:processMessages contentStructVer="3.1.3" createDateTime="2016-02-20T22:56:02Z" requestId="{{ UUID }}">
			<ns2:msgEnvelopeList>
				<ns0:envelope>
					<ns0:header>
						<!-- Predefined Values in the System
						Sender is a text value for the sender.  C
						-->
						<ns0:msgInfo>
						<ns0:sysDeploymentId xsi:type="ns3:QualifiedIdType" qlfr="SYS_DEF">Receiver</ns0:sysDeploymentId>
						<ns0:senderInstId xsi:type="ns3:QualifiedIdType" qlfr="SYS_DEF">Sender</ns0:senderInstId>
						<ns0:senderId xsi:type="ns3:TypedQualifiedIdType" qlfr="ORG_DEF" type="ORG_ID">0358716000006</ns0:senderId>
						<ns0:receiverInstId xsi:type="ns3:QualifiedIdType" qlfr="SYS_DEF">rfXcel</ns0:receiverInstId>
						<ns0:receiverId xsi:type="ns3:TypedQualifiedIdType" qlfr="ORG_DEF" type="ORG_ID">0302250155012</ns0:receiverId>
						<ns0:msgFormat xsi:type="ns3:OptionallyVersionedEnumType">XML</ns0:msgFormat>
						<ns0:msgType xsi:type="ns3:OptionallyVersionedEnumType" ver="1.1">SYS_EVENTS_ENV</ns0:msgType>
						</ns0:msgInfo>
					</ns0:header>
					<ns0:body>
						<XML_SYS_EVENTS_ENV>
            {% autoescape false %}
            {{ rule_context.context.OUTBOUND_EPCIS_MESSAGE }}
            {% endautoescape %}
						</XML_SYS_EVENTS_ENV>
					</ns0:body>
				</ns0:envelope>
			</ns2:msgEnvelopeList>
		</ns2:processMessages>
	</ns1:Body>
</SOAP-ENV:Envelope>

